Documents/ЗаписьЖРОИГП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЗаписьЖРОИГП</Name>
			<BasedOn>
				<xr:Item>Document.ОтчетПроизводстваЗаСмену</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Технолог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВетВрач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кладовщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетПроизводства</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТМЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВНВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВНК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>З</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>К</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>В</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>С</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СредТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СредВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СредК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СредО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаписьЖРОИГП/Ext/ManagerModule.bsl
// Подготовка реквизитов организации через стандартный механизм УТП
Функция РеквизитыОрганизации(Орг, Дата)

	СведОрг = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Орг, Дата);

	Рез = Новый Структура;
	Рез.Вставить("НазваОрг",       Орг.НаименованиеПолное);
	Рез.Вставить("АдресОрг",       СведОрг.ЮридическийАдрес);
	Рез.Вставить("ЄДРПОУ",         СведОрг.КодПоЕДРПОУ);
	Рез.Вставить("ІПНОрг",         "ІПН " + СведОрг.ИНН);
	Рез.Вставить("ТелефониОрг",    "тел. " + СведОрг.Телефоны);
	Рез.Вставить("НомерСвідоцтва", СведОрг.НомерСвидетельства);
	Рез.Вставить("РеквизитыРС",    ФормированиеПечатныхФорм.ОписаниеОрганизации(СведОрг, "НомерСчета,Банк,МФО,"));
	Возврат Рез;

КонецФункции // РеквизитыОрганизации // + claude

// Заполнение параметров шапки макета реквизитами организации
Процедура ЗаполнитьШапкуОрг(Область, РеквОрг)

	Область.Параметры.ДатаУкр        = РеквОрг.ДатаУкр; // заполняется снаружи
	Область.Параметры.НазваОрг       = РеквОрг.НазваОрг;
	Область.Параметры.АдресОрг       = РеквОрг.АдресОрг;
	Область.Параметры.ЄДРПОУ         = РеквОрг.ЄДРПОУ;
	Область.Параметры.ІПНОрг         = РеквОрг.ІПНОрг;
	Область.Параметры.ТелефониОрг    = РеквОрг.ТелефониОрг;
	Область.Параметры.НомерСвідоцтва = РеквОрг.НомерСвідоцтва;
	Область.Параметры.РеквизитыРС    = РеквОрг.РеквизитыРС;

КонецПроцедуры // ЗаполнитьШапкуОрг // + claude

// Дегустационный лист
// ХвостПодписанта: "" = Технолог, "В" = ВетВрач, "К" = Кладовщик
Функция СформироватьДекЛист(СсылкаДокумента, Знач ХвостПодписанта = "") Экспорт

	ДокОбъект = СсылкаДокумента.ПолучитьОбъект();
	Макет = ПолучитьМакет("ДекЛист");
	
	СоотвПодписей = Новый Соответствие();
	СоотвПодписей.Вставить("","технолога");
	СоотвПодписей.Вставить("К","комірника");
	СоотвПодписей.Вставить("В","рабітника сан-вет. служби");

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПЕЧАТЬ_ДекЛист";

	РеквОрг = РеквизитыОрганизации(ДокОбъект.Организация, ДокОбъект.Дата); // + claude
	РеквОрг.Вставить("ДатаУкр", Формат(ДокОбъект.Дата,"Л=uk; ДЛФ=DD"));

	// Шапка
	Область = Макет.ПолучитьОбласть("Шапка");
	ЗаполнитьШапкуОрг(Область, РеквОрг);
	Область.Параметры.ТекстПодписи =  СоотвПодписей.Получить(ХвостПодписанта);
	ТабДок.Вывести(Область);

	// Суффикс средней оценки: "" → "Т", "В" → "В", "К" → "К"
	СуффСред = ?(ХвостПодписанта = "", "Т", ?(ХвостПодписанта = "В", "В", "К"));

	// Строки ТЧ
	ОбластьСтр = Макет.ПолучитьОбласть("Строка");
	Для Каждого Строка Из ДокОбъект.ТМЦ Цикл
		ОбластьСтр.Параметры.ДатаРядок      = ДокОбъект.Дата;
		ОбластьСтр.Параметры.НазваПродукту  = Строка.ТМЦ.НаименованиеПолное;
		ОбластьСтр.Параметры.Оц1            = Строка["ВН" + ХвостПодписанта];
		ОбластьСтр.Параметры.Оц2            = Строка["Ц"  + ХвостПодписанта];
		ОбластьСтр.Параметры.Оц3            = Строка["З"  + ХвостПодписанта];
		ОбластьСтр.Параметры.Оц4            = Строка["К"  + ХвостПодписанта];
		ОбластьСтр.Параметры.Оц5            = Строка["В"  + ХвостПодписанта];
		ОбластьСтр.Параметры.Оц6            = Строка["С"  + ХвостПодписанта];
		ОбластьСтр.Параметры.СредОц         = Строка["Сред" + СуффСред];
		ТабДок.Вывести(ОбластьСтр);
	КонецЦикла; // Для Каждого Строка // + claude

	// Дно
	ОбластьДно = Макет.ПолучитьОбласть("Дно");
	ТабДок.Вывести(ОбластьДно);

	Возврат ТабДок;

КонецФункции // СформироватьДекЛист // + claude

// Общий журнал регистрации ОИГП
Функция СформироватьОбщую(СсылкаДокумента) Экспорт

	ДокОбъект = СсылкаДокумента.ПолучитьОбъект();
	Макет = ПолучитьМакет("Общая");

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПЕЧАТЬ_ЖурналОИГП";

	РеквОрг = РеквизитыОрганизации(ДокОбъект.Организация, ДокОбъект.Дата); // + claude
	РеквОрг.Вставить("ДатаУкр", Формат(ДокОбъект.Дата,"Л=uk; ДЛФ=DD"));

	// Шапка
	Область = Макет.ПолучитьОбласть("Шапка");
	ЗаполнитьШапкуОрг(Область, РеквОрг);
	Область.Параметры.ФІОТехнолог = ДокОбъект.Технолог.Наименование;
	Область.Параметры.ФІОВетЛікар = ДокОбъект.ВетВрач.Наименование;
	Область.Параметры.ФІОКомірник = ДокОбъект.Кладовщик.Наименование;
	ТабДок.Вывести(Область);

	// Строки ТЧ
	ОбластьСтр = Макет.ПолучитьОбласть("Строка");
	Для Каждого Строка Из ДокОбъект.ТМЦ Цикл
		ОбластьСтр.Параметры.НазваПродукту = Строка.ТМЦ.НаименованиеПолное;
		ОбластьСтр.Параметры.СредО         = Строка.СредО;
		ТабДок.Вывести(ОбластьСтр);
	КонецЦикла; // Для Каждого Строка // + claude

	// Дно
	ОбластьДно = Макет.ПолучитьОбласть("Дно");
	ТабДок.Вывести(ОбластьДно);

	Возврат ТабДок;

КонецФункции // СформироватьОбщую // + claude
